Repository: IrakozeLoraine/quickride_app
Catalog: lib/l10n/app_*.arb
Languages: fr, rw

# appDescription
source: QuickRide is a motorcycle ride-sharing app that connects riders and passengers for quick and affordable rides.
fr: QuickRide est une application de covoiturage à moto qui connecte les conducteurs et les passagers pour des trajets rapides et abordables.
rw: QuickRide ni porogaramu yo gusangira ingendo za moto ihuza abashoferi n'abagenzi ku ngendo zihuse kandi zidahenze.

# copyRight
source: © 2025 QuickRide. All rights reserved.
fr: © 2025 QuickRide. Tous droits réservés.
rw: Â© 2025 QuickRide. Uburenganzira bwose burabitswe.

# welcomeMessage
source: Welcome to QuickRide
fr: Bienvenue sur QuickRide
rw: Murakaza neza kuri QuickRide

# loginTitle
source: Login
fr: Connexion
rw: Kwinjira

# registerTitle
source: Register
fr: Inscription
rw: Kwiyandikisha

source: Phone Number
fr: Numéro de téléphone
rw: Nimero ya telefoni

source: Password
fr: Mot de passe
rw: Ijambo ry'ibanga

source: Confirm Password
fr: Confirmer le mot de passe
rw: Emeza ijambo ry'ibanga

# name
source: Full Name
fr: Nom complet
rw: Amazina yombi

source: Email
rw: Imeri

# loginButton
source: Login
fr: Se connecter
rw: Injira

# registerButton
source: Register
fr: S'inscrire
rw: Iyandikishe

# noAccount
source: Don't have an account?
fr: Vous n'avez pas de compte?
rw: Nta konti ufite?

# hasAccount
source: Already have an account?
fr: Vous avez déjà un compte?
rw: Usanzwe ufite konti?

source: Sign Up
fr: S'inscrire
rw: Iyandikishe

source: Sign In
fr: Se connecter
rw: Injira

source: Forgot Password
fr: Mot de passe oublié
rw: Wibagiwe ijambo ry'ibanga

source: Reset Password
fr: Réinitialiser le mot de passe
rw: Simbuza ijambo ry'ibanga

# resetPasswordInstructions
source: Please enter your email address. We will send you a link to reset your password.
fr: Veuillez entrer votre adresse email. Nous vous enverrons un lien pour réinitialiser votre mot de passe.
rw: Nyamuneka shyiramo aderesi yawe y'imeri. Tuzohereza umurongo wo gusimbuza ijambo ry'ibanga.

source: Password reset email sent
fr: Email de réinitialisation du mot de passe envoyé
rw: Email yo gusimbuza ijambo ry'ibanga yoherejwe

# passwordResetSuccess
source: We've sent a password reset link to
fr: Nous avons envoyé un lien de réinitialisation du mot de passe à
rw: Tohereje umurongo wo gusimbuza ijambo ry'ibanga kuri

# pleaseCheckEmailInbox
source: Please check your email inbox and follow the instructions to reset your password.
fr: Veuillez vérifier votre boîte de réception et suivre les instructions pour réinitialiser votre mot de passe.
rw: Nyamuneka reba mu ibaruwa yawe kandi ukurikize amabwiriza yo gusimbuza ijambo ry'ibanga.

source: Verification
fr: Vérification
rw: Kwemeza

# verifyYourNumber
source: Verify your phone number
fr: Vérifiez votre numéro de téléphone
rw: Emeza nimero yawe ya telefoni

# weHaveSentCode
source: We have sent a verification code to
fr: Nous avons envoyé un code de vérification à
rw: Twohereje kode yo kwemeza kuri

source: Verify code
fr: Vérifier le code
rw: Emeza kode

# didnotReceiveCode
source: Didn’t receive the code?
fr: Vous n'avez pas reçu le code?
rw: Ntiwakiriye kode?

source: Invalid verification code
fr: Code de vérification invalide
rw: Kode yo kwemeza ntabwo ari yo

source: How do you want to use
fr: Comment souhaitez-vous utiliser
rw: Nigute wifuza gukoresha

source: Find motorcycle riders for quick and affordable rides
fr: Trouvez des chauffeurs de moto pour des trajets rapides et abordables
rw: Shaka abashoferi ba moto ku ngendo zihuse kandi zidahenze

# offerMotorcyleRidesAndEarnMoney
source: Offer motorcycle rides and earn money
fr: Proposez des trajets en moto et gagnez de l'argent
rw: Tanga ingendo za moto kandi winjize amafaranga

source: Resend in
fr: Renvoyer dans
rw: Ohereza indi muri

source: seconds
fr: secondes
rw: amasegonda

source: Resend Code
fr: Renvoyer le code
rw: Ohereza kode

source: Continue as Rider
fr: Continuer en tant que chauffeur
rw: Komeza nk'umushoferi

source: Continue as Passenger
fr: Continuer en tant que passager
rw: Komeza nk'umugenzi

source: Rider Registration
fr: Inscription du chauffeur
rw: Kwiyandikisha k'umushoferi

source: Complete your rider profile
fr: Complétez votre profil de chauffeur
rw: Uzuza umwirondoro wawe w'umushoferi

# pleaseProvideMotorcycleDetails
source: Please provide your motorcycle details
fr: Veuillez fournir les détails de votre moto
rw: Tanga amakuru ya moto yawe

# currentLocationWillBeUsedAsInitialPositionOnMap
source: Your current location will be used as the initial position on the map.
fr: Votre position actuelle sera utilisée comme position initiale sur la carte.
rw: Aho uri ubu hazakoreshwa nk'ahantu h'ibanze ku ikarita.

source: License Number
fr: Numéro de permis
rw: Nimero y'uruhushya

# enterYourLicenseNumber
source: Please enter your license number
fr: Veuillez entrer votre numéro de permis
rw: Shyiramo nimero y'uruhushya rwawe

source: Plate Number
fr: Numéro d'immatriculation
rw: Nimero ya moto

# enterYourPlateNumber
source: Please enter your plate number
fr: Veuillez entrer votre numéro d'immatriculation
rw: Shyiramo nimero ya moto yawe

source: Motorcycle Model
fr: Modèle de moto
rw: Ubwoko bwa moto

# enterYourMotorcycleModel
source: Please enter your motorcycle model
fr: Veuillez entrer le modèle de votre moto
rw: Shyiramo ubwoko bwa moto yawe

source: Next
fr: Suivant
rw: Komeza

source: Back
fr: Retour
rw: Gusubira inyuma

source: Personal Information
fr: Informations personnelles
rw: Amakuru yihariye

source: Not Available
fr: Non disponible
rw: Ntabwo aboneka

source: Member Since
fr: Membre depuis
rw: Ukoresha porogaramu kuva

source: Rider Information
fr: Informations sur le chauffeur
rw: Amakuru y'umushoferi

source: Ride Information
fr: Informations sur le trajet
rw: Amakuru y'urugendo

source: Loading ride details...
fr: Chargement des détails du trajet...
rw: Tegereza gato, turimo gukurura amakuru y'urugendo

source: Create Your Account
fr: Créer votre compte
rw: Tangiza konti yawe

# registerAsRider
source: Register as a rider and start earning
fr: Inscrivez-vous en tant que chauffeur et commencez à gagner
rw: Iyandikishe nk'umushoferi maze utangire kubona abagenzi

# registerAsPassenger
source: Register as a passenger and find rides easily
fr: Inscrivez-vous en tant que passager et trouvez facilement des trajets
rw: Iyandikishe nk'umugenzi maze ubashe gukora ingendo byoroshye

# pleaseUseSpecificLocationToSave
source: Please use a specific pickup location to save
fr: Veuillez utiliser un lieu spécifique pour enregistrer
rw: Nyamuneka kora ku ikarita kugirango uhitemo ahantu ushaka kubika

source: Rides
fr: Trajets
rw: Ingendo

source: Rider
fr: Chauffeur
rw: Umushoferi

source: Passenger
fr: Passager
rw: Umugenzi

source: Your Rider
fr: Votre chauffeur
rw: Umushoferi wawe

source: Your Passenger
fr: Votre passager
rw: Umugenzi wawe

source: User
fr: Utilisateur
rw: Ukoresha porogaramu

# enterName
source: Please enter your name
fr: Veuillez entrer votre nom
rw: Shyiramo amazina yawe

# enterEmail
source: Please enter your email
fr: Veuillez entrer votre email
rw: Shyiramo aderesi y'imeri yawe

# enterPhoneNumber
source: Please enter your phone number
fr: Veuillez entrer votre numéro de téléphone
rw: Shyiramo nimero ya telefoni yawe

# enterValidPhoneNumber
source: Phone number must be 10 digits
fr: Le numéro de téléphone doit comporter 10 chiffres
rw: Nimero ya telefoni igomba kuba ifite imibare 10

# enterValidEmail
source: Please enter a valid email
fr: Veuillez entrer un email valide
rw: Shyiramo aderesi y'imeri iboneye

# enterPassword
source: Please enter your password
fr: Veuillez entrer votre mot de passe
rw: Shyiramo ijambo ry'ibanga

# enterValidPassword
source: Password must be at least 6 characters
fr: Le mot de passe doit comporter au moins 6 caractères
rw: Ijambo ry'ibanga rigomba kuba rifite nibura inyuguti 6

# enterConfirmPassword
source: Please confirm your password
fr: Veuillez confirmer votre mot de passe
rw: Emeza ijambo ry'ibanga

# passwordMismatch
source: Passwords do not match
fr: Les mots de passe ne correspondent pas
rw: Amagambo y'ibanga ntabwo ahuye

# loginFailed
source: Login failed. Please check your credentials.
fr: Échec de la connexion. Veuillez vérifier vos identifiants.
rw: Kwinjira byanze. Nyamuneka reba ibyangombwa byawe.

# registrationFailed
source: Registration failed. Please try again.
fr: Échec de l'inscription. Veuillez réessayer.
rw: Kwiyandikisha byanze. Ongera ugerageze.

# resetEmailFailed
source: Failed to send reset email. Please try again.
fr: Échec de l'envoi de l'email de réinitialisation. Veuillez réessayer.
rw: Gutanga email yo gusubiza byanze. Ongera ugerageze.

# failedToAcceptFare
source: Failed to accept fare. Please try again.
fr: Échec de l'acceptation du tarif. Veuillez réessayer.
rw: Kwanga igiciro byanze. Ongera ugerageze.

# failedToProposeFare
source: Failed to propose fare. Please try again.
fr: Échec de la proposition du tarif. Veuillez réessayer.
rw: Gutanga igiciro byanze. Ongera ugerageze.

# failedToSubmitRating
source: Failed to submit rating. Please try again.
fr: Échec de la soumission de l'évaluation. Veuillez réessayer.
rw: Gutanga igipimo byanze. Ongera ugerageze.

# failedToCancelRide
source: Failed to cancel ride. Please try again.
fr: Échec de l'annulation du trajet. Veuillez réessayer.
rw: Guhagarika urugendo byanze. Ongera ugerageze.

# failedToCompleteRide
source: Failed to complete ride. Please try again.
fr: Échec de la finalisation du trajet. Veuillez réessayer.
rw: Gusoza urugendo byanze. Ongera ugerageze.

# failedToStartRide
source: Failed to start ride. Please try again.
fr: Échec du démarrage du trajet. Veuillez réessayer.
rw: Gutangira urugendo byanze. Ongera ugerageze.

# failedToAcceptRide
source: Failed to accept ride. Please try again.
fr: Échec de l'acceptation du trajet. Veuillez réessayer.
rw: Kwanga urugendo byanze. Ongera ugerageze.

# failedToSaveLocation
source: Failed to save location. Please try again.
fr: Échec de l'enregistrement du lieu. Veuillez réessayer.
rw: Guhagarika ahantu byanze. Ongera ugerageze.

# failedToRequestRide
source: Failed to request ride. Please try again.
fr: Échec de la demande de trajet. Veuillez réessayer.
rw: Gusaba urugendo byanze. Ongera ugerageze.

# failedToRegisterRider
source: Failed to register as rider. Please try again.
fr: Échec de l'inscription du chauffeur. Veuillez réessayer.
rw: Kwiyandikisha k'umushoferi byanze. Ongera ugerageze.

# ratingSubmitted
source: Rating submitted successfully
fr: Évaluation soumise avec succès
rw: Igipimo cyoherejwe neza

# rideStarted
source: Ride started successfully
fr: Trajet démarré avec succès
rw: Urugendo rwatangiye

source: Location saved
fr: Lieu enregistré
rw: Aho hantu habitswe

source: Select Pickup and Drop-off Location
fr: Sélectionner le lieu de prise en charge et de dépose
rw: Hitamo ahantu ho gufatirwa no gusigwa

source: Find a Ride
fr: Trouver un trajet
rw: Nshaka urugendo

# whereToGo
source: Where do you want to go?
fr: Où voulez-vous aller?
rw: Urifuza kujya he?

source: Current Location
fr: Position actuelle
rw: Aho uri

source: Destination
rw: Aho ujya

# proposeFare
source: Propose Fare (RWF)
fr: Proposer un tarif (RWF)
rw: Shyiraho igiciro (RWF)

source: Propose Counter Offer
fr: Proposer une contre-offre (RWF)
rw: Shyiraho igiciro wifuza

source: Propose
fr: Proposer
rw: Shyiraho igiciro

source: Fare proposal sent
fr: Proposition de tarif envoyée
rw: Igiciro cyoherejwe

source: Request Ride
fr: Demander un trajet
rw: Saba urugendo

source: Nearby Riders
fr: Chauffeurs à proximité
rw: Abashoferi bari hafi

source: Ride History
fr: Historique des trajets
rw: Amateka y'ingendo

source: Profile
fr: Profil
rw: Umwirondoro

source: Settings
fr: Paramètres
rw: Igenamiterere

source: Logout
fr: Déconnexion
rw: Gusohoka

source: Language
fr: Langue
rw: Ururimi

source: English
fr: Anglais
rw: Icyongereza

source: French
fr: Français
rw: Igifaransa

source: Kinyarwanda
rw: Ikinyarwanda

source: Theme
fr: Thème
rw: Ibara rya porogaramu

source: Light
fr: Clair
rw: Iryoroheje

source: Dark
fr: Sombre
rw: Iryijimye

source: Notifications
rw: Imenyesha

# help
source: Help & Support
fr: Aide et support
rw: Ubufasha

# about
source: About QuickRide
fr: À propos de QuickRide
rw: Ibyerekeye QuickRide

source: Ride Details
fr: Détails du trajet
rw: Ibisobanuro by'urugendo

source: Pickup
fr: Point de départ
rw: Aho ufatirwa

source: Dropoff
fr: Destination
rw: Aho usigara

source: Pickup Location
fr: Lieu de prise en charge
rw: Aho gufatirwa

source: Dropoff Location
fr: Lieu de dépose
rw: Aho gupakurirwa

source: Fare
fr: Tarif
rw: Igiciro

source: Status
fr: Statut
rw: Imiterere

source: Ride In Progress
fr: Trajet en cours
rw: Urugendo rurimo gukorwa

source: Ride Completed
fr: Trajet terminé
rw: Urugendo rwakozwe

source: Ride Cancelled
fr: Trajet annulé
rw: Urugendo rwahagaritswe

source: Rate Your Ride
fr: Évaluez votre trajet
rw: Tubwire uko urugendo rwagenze

source: Submit Review
fr: Soumettre l'évaluation
rw: Ohereza igitekerezo

source: Cancel Ride
fr: Annuler le trajet
rw: Hagarika urugendo

# confirmCancelRide
source: Are you sure you want to cancel this ride?
fr: Êtes-vous sûr de vouloir annuler ce trajet?
rw: Wizeye ko ushaka guhagarika uru rugendo?

source: Yes
fr: Oui
rw: Yego

source: No
fr: Non
rw: Oya

# riderArriving
source: Rider is arriving
fr: Le chauffeur arrive
rw: Umushoferi araza

# riderArrived
source: Rider has arrived
fr: Le chauffeur est arrivé
rw: Umushoferi arageze

# eta
source: ETA: {minutes} min
rw: Igihe cyo kugera: iminota {minutes}

source: Rating
fr: Évaluation
rw: Igipimo

# distanceOnly
source: Distance
rw: Intera

source: Duration
fr: Durée
rw: Igihe

source: Agreed
fr: Convenue
rw: Ayemewe

source: Proposed
fr: Proposée
rw: Ikifuzo cyatanzwe

# distance
source: Distance: {distance} km
rw: Intera: {distance} km

source: Fare negotiation
fr: Négociation du tarif
rw: Kuganira ku giciro

# passengerOffer
source: Passenger's Offer: {amount} RWF
fr: Offre du passager: {amount} RWF
rw: Igiciro cy'umugenzi: {amount} RWF

source: Your Counter Offer
fr: Votre contre-offre
rw: Igiciro cy' ibyo wifuza

# yourCounter
source: Your Counter: {amount} RWF
fr: Votre contre-offre: {amount} RWF
rw: Igiciro cyawe: {amount} RWF

source: Select Pickup Location
fr: Sélectionner le lieu de prise en charge
rw: Hitamo aho gufatirwa

source: Select Destination
fr: Sélectionner la destination
rw: Hitamo aho gusigwa

source: Search Location
fr: Rechercher un lieu
rw: Shaka ahantu

source: Use Current Location
fr: Utiliser la position actuelle
rw: Koresha aho uri ubu

source: Accept Offer
fr: Accepter l'offre
rw: Emera igiciro

source: Proposed Fare
fr: Tarif proposé
rw: Igiciro cyatanzwe

source: Make Counter Offer
fr: Faire une contre-offre
rw: Shyiraho igiciro gitandukanye

source: Reject Ride
fr: Rejeter le trajet
rw: Kwanga urugendo

source: Go Online
fr: Se mettre en ligne
rw: Tangira gukora

source: Go Offline
fr: Se mettre hors ligne
rw: Reka gukora

source: Available for Rides
fr: Disponible pour les trajets
rw: Uraboneka ku ngendo

source: Unavailable for Rides
fr: Indisponible pour les trajets
rw: Ntabwo mboneka ku ngendo

source: Emergency Contact
fr: Contact d'urgence
rw: Uwo guhamagara mu bihe by'amage

source: Add Emergency Contact
fr: Ajouter un contact d'urgence
rw: Ongeraho uwo guhamagara mu bihe by'amage

# errorMessage
source: An error occurred. Please try again.
fr: Une erreur s'est produite. Veuillez réessayer.
rw: Habaye ikibazo. Ongera ugerageze.

# successMessage
source: Operation completed successfully
fr: Opération terminée avec succès
rw: Birangiye neza

# loadingMessage
source: Please wait...
fr: Veuillez patienter...
rw: Tegereza gato...

source: Ride request sent
fr: Demande de trajet envoyée
rw: Urugendo rwasabwe

source: Fare Accepted
fr: Tarif accepté
rw: Igiciro cyemerewe

source: Ride Request
fr: Demande de trajet
rw: Ingendo zasabwe

source: Searching for riders...
fr: Recherche de chauffeurs...
rw: Gushaka abashoferi...

source: Loading address...
fr: Chargement de l'adresse...
rw: Tegereza gato, turimo gukurura aderesi...

# myRideRequest
source: My Ride Requests
fr: Ma demande de trajet
rw: Ingendo nasabye

source: No pending ride requests
fr: Aucune demande de trajet en attente
rw: Nta ngendo zasabwe

source: Your pending ride requests will appear here
fr: Vos demandes de trajet en attente apparaîtront ici
rw: Ingendo zasabwe zizagaragara hano

# requestNewRide
source: Request a New Ride
fr: Demander un nouveau trajet
rw: Saba urugendo rushya

# noRidersFound
source: No riders found nearby
fr: Aucun chauffeur trouvé à proximité
rw: Nta mushoferi wabonetse hafi

# noRideHistory
source: No ride history yet
fr: Aucun historique de trajet disponible
rw: Nta mateka y'urugendo aboneka

source: No recent locations
fr: Aucun lieu récent trouvé
rw: Nta hantu uherutse

source: Your completed rides will appear here
fr: Vos trajets terminés apparaîtront ici
rw: Ingendo zakozwe zizagaragara hano

source: Try Again
fr: Réessayer
rw: Ongera ugerageze

source: Confirm Ride
fr: Confirmer le trajet
rw: Emeza urugendo

source: Ride Confirmed
fr: Trajet confirmé
rw: Urugendo rwemejwe

source: Start Ride
fr: Commencer le trajet
rw: Tangira urugendo

source: End Ride
fr: Terminer le trajet
rw: Rangiza urugendo

source: Complete Ride
fr: Terminer le trajet
rw: Rangiza urugendo

source: Reject Request
fr: Rejeter la demande
rw: Anga ubusabe

source: Counter Offer
fr: Contre-offre
rw: Igiciro wifuza

source: Passenger's Offer
fr: Offre du passager
rw: Igiciro cy'umugenzi

source: Rider's Counter Offer
fr: Contre-offre du chauffeur
rw: Igiciro cyifuzwa n'umushoferi

source: Your Offer
fr: Votre offre
rw: Igiciro cyawe

source: Rate this Ride
fr: Évaluer ce trajet
rw: Tubwire uko uru urugendo rwagenze

# yourRideIsOnTheWay
source: Your rider is on the way to pick you up.
fr: Votre trajet est en route
rw: Umushoferi wawe arimo kuza

# rideCompletedThanksForUsingApp
source: Ride completed. Thank you for using QuickRide!
fr: Trajet terminé. Merci d'avoir utilisé QuickRide
rw: Urugendo rwasojwe. Murakoze gukoresha QuickRide.

# youAreOnYourWayToDestination
source: You are on your way to your destination
fr: Vous êtes en route vers votre destination
rw: Uri mu nzira ujya aho bagusiga

# takeYourPassengerToDestination
source: Take your passenger to their destination
fr: Amenez votre passager à sa destination
rw: Jyana umugenzi wawe aho agomba kujya

source: Head to the pickup location to get your passenger
fr: Dirigez-vous vers le lieu de prise en charge pour récupérer votre passager
rw: Jya aho gufatirwa kugira ngo ufate umugenzi wawe

# thankYouForRidingWithApp
source: Thank you for riding with QuickRide!
fr: Merci d'avoir voyagé avec QuickRide!
rw: Murakoze gukoresha QuickRide!

source: Taking passenger to destination
fr: Amener le passager à sa destination
rw: Uri kujyana umugenzi wawe aho agomba kujya

source: On the way to your destination
fr: En route vers votre destination
rw: Uri mu nzira ujya aho ugomba kujya

source: Heading to Pickup Location
fr: En route vers le lieu de prise en charge
rw: Uri mu nzira ujya gufata umugenzi

source: Rider is on the way to your location
fr: Le chauffeur est en route vers votre position
rw: Umushoferi wawe arimo kuza aho uri

source: Discussing fare with rider
fr: Discussion du tarif avec le chauffeur
rw: Urimo kuganira ku giciro

# thisRideCancelled
source: This ride has been cancelled
fr: Ce trajet a été annulé
rw: Uru rugendo rwahagaritswe

# thisRideCompleted
source: This ride has been completed. Thank you for your service!
fr: Ce trajet est terminé. Merci d'avoir utilisé QuickRide
rw: Uru rugendo rwasojwe. Murakoze gukoresha QuickRide.

source: Ride not found
fr: Trajet non trouvé
rw: Urugendo ntirwabashije kuboneka

# waitingForRider
source: Waiting for rider to accept
fr: En attente d'acceptation du chauffeur
rw: Dutegereje ko umushoferi yemera

source: Waiting for rider to accept your request
fr: En attente que le chauffeur accepte votre demande
rw: Dutegereje ko umushoferi yemera ubusabe

source: Enter Amount
fr: Entrer le montant
rw: Shyiramo umubare

# enterValidAmount
source: Please enter a valid amount
fr: Veuillez entrer un montant valide
rw: Shyiramo igiciro cyemewe

# enterFareAmount
source: Please enter fare amount
fr: Veuillez entrer le montant du tarif
rw: Shyiramo igiciro (RWF)

# enterFareValidAmount
source: Please enter a valid fare amount
fr: Veuillez entrer un montant de tarif valide
rw: Shyiramo igiciro cyemewe (RWF)

source: Saved Places
fr: Lieux enregistrés
rw: Ahantu h'ingenzi

source: Save Location
fr: Enregistrer le lieu
rw: Bika ahantu

source: Save Current Location
fr: Enregistrer la position actuelle
rw: Bika ahantu uri ubu

# noSavedPlaces
source: No saved places yet
fr: Aucun lieu enregistré
rw: Nta hantu h'ingenzi wari wabika

source: See all saved places
fr: Voir tous les lieux enregistrés
rw: Reba ahantu h'ingenzi hose

source: Recent Locations
fr: Lieux récents
rw: Ahantu uherutse

source: Save this Location
fr: Enregistrer ce lieu
rw: Bika aha hantu

source: Clear History
fr: Effacer l'historique
rw: Siba amateka y'urugendo

# confirmClearHistory
source: Are you sure you want to clear your recent locations history?
fr: Êtes-vous sûr de vouloir effacer l'historique?
rw: Wizeye ko ushaka gusiba amateka y' igendo za vuba aha zawe?

# recentLocationsCleared
source: Recent locations history cleared
fr: Emplacements récents effacés
rw: Amateka y'urugendo yawe yasibwe

source: Set as Pickup Location
fr: Définir le lieu de prise en charge
rw: Shyiraho aho gufatirwa

source: Set as Destination
fr: Définir la destination
rw: Shyiraho aho gusigara

source: Confirm
fr: Confirmer
rw: Emeza

source: View
fr: Voir
rw: Reba

source: Cancel
fr: Annuler
rw: Hagarika

source: Submit
fr: Soumettre
rw: Ohereza

source: Skip
fr: Passer
rw: Simbuka

source: Clear
fr: Effacer
rw: Siba

# addReview
source: Add a review (optional)
fr: Ajouter une évaluation (facultatif)
rw: Gira icyo uvuga ku mushoferi (niba ubishaka)

source: Address
fr: Adresse
rw: Aderesi

source: Location Name
fr: Nom du lieu
rw: Amazina y'ahantu

# locationHint
source: Home, Work, School, etc.
fr: Residence, bureau, école, etc.
rw: Mu rugo, ku kazi, ku ishuri, n'ahandi

source: How was your ride experience?
fr: Comment était votre expérience de trajet?
rw: Ni gute urugendo rwawe rwagenze?

source: Refresh
fr: Rafraîchir
rw: Reba impinduka

# closeButtonLabel
source: Close
fr: Fermer
rw: Funga

# viewLicensesButtonLabel
source: View Licenses
fr: Voir les licences
rw: Reba Impushya

source: Contact Us
fr: Contactez-nous
rw: Tuvugishe

# emailAlreadyInUse
source: The email address is already in use by another account.
fr: Cet email est déjà utilisé.
rw: Imeri ifite undi uyikoresha.

# invalidEmail
source: The email address is not valid.
fr: Email invalide.
rw: Imeri ntabwo iboneye.

# weakPassword
source: The password is too weak.
fr: Le mot de passe est trop faible.
rw: Ijambo ry'ibanga ni rito cyane.

# operationNotAllowed
source: Email/password accounts are not enabled.
fr: Opération non autorisée.
rw: Imeri cyangwa ijambo ry'ibanga ntabwo byemewe.

# somethingWentWrong
source: Something went wrong. Please try again.
fr: Une erreur s'est produite. Veuillez réessayer.
rw: Habaye ikibazo. Ongera ugerageze.

# userNotFound
source: No user found with this email address.
fr: Utilisateur non trouvé.
rw: Ukoresha iyi imeri ntabonetse.

# wrongCredentials
source: The email address or password is incorrect.
fr: Le address email ou le mot de passe est incorrect.
rw: Ijambo ry'ibanga cyangwa imeri ntabwo ari byo.

# userDisabled
source: Your account has been disabled by an administrator.
fr: Votre compte a été désactivé par l'administrateur.
rw: Konti yawe yarahagaritswe n'umuyobozi.
