Repository: IrakozeLoraine/quickride_app
Catalog: lib/l10n/app_*.arb
Languages: fr, rw

# cannotGoOnlineLocationUnavailable
source: You cannot go online because your location is unavailable.
fr: Impossible de se mettre en ligne. La localisation est indisponible.
rw: Ntushobora kujya kuri interineti. Ahantu uherereye ntihaboneka.

# locationIsRequiredToRegisterAsRider
source: Location is required to register as a rider.
fr: La localisation est requise pour s'inscrire en tant que chauffeur.
rw: Ahantu uherereye ni ngombwa kugirango wiyandikishe nk'umushoferi.

source: Home
fr: Accueil
rw: Ahabanza

source: Requested
fr: Demandé
rw: Yasabye

source: Negotiating
fr: Négociation
rw: Kuganira

source: Accepted
fr: Accepté
rw: Yemerewe

source: In Progress
fr: En cours
rw: Birakomeje

source: Completed
fr: Terminé
rw: Byarangiye

source: Cancelled
fr: Annulé
rw: Byahagaritswe

source: Check Ride Requests
fr: Vérifier les demandes de trajet
rw: Reba ingendo zasabwe

source: Ride Requested
fr: Trajet demandé
rw: Urugendo rwahamagajwe

source: Ride Accepted
fr: Trajet accepté
rw: Urugendo rwakiriwe
